---
type: StairsEditScope
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# StairsEditScope

`Autodesk.Revit.DB.StairsEditScope` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StairsEditScope | 2013 | `public StairsEditScope ( Document document , string transactionName )` |
| Method | Start | — | `` |